---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.CannotDeleteInfill
source: html/914040e3-dcd3-b686-53a9-b93b93aa16fb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.CannotDeleteInfill Property

Can't delete infilling element without deleting its insert or host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDeleteInfill { get; }
```